app/views/branches/show.json.jbuilder

json.extract! @branch, :id, :name, :description, :city_id, :company_id, :manager_id, :created_at, :updated_at
json.boss @branch.company.user.nil? ? "" : "#{@branch.company.user.first_name} #{@branch.company.user.last_name}"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]