app/views/users/sessions/new.html.slim

SELECT "companies".* FROM "companies"
---
      /= t('.template')
      = image_tag "logo1.png", alt:"Planet Agrotrailer"
  .login-box-body ng-init="companies = #{Company.all.to_json}"

SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC
---
      .form-group.has-feedback
        = f.select :current_company, options_for_select(Company.all.order(name: :asc).map {|u| [u.name, u.id]}),
                {include_blank: t('helpers.select.prompt')}, class: 'form-control'
      .row
        .col-xs-6
          .checkbox.icheck