app/views/departments/_form.html.slim

      .col-sm-10
        = f.collection_select(:manager_id, User.admins_department, :id, :full_name,
                {prompt: t('helpers.select.prompt')}, {class: 'form-control'})
---
SELECT "users".* FROM "users"