app/views/departments/employee_items.html.slim

        = form_tag(users_assign_item_path, method: 'PUT', id: 'assign-item')
          = select_tag 'item[status_item_id]',
                  options_for_select(StatusItem.all.map {|s| [s.name, s.id]}), {class: 'form-control'}
---
SELECT "items".* FROM "items" WHERE "items"."department_id" = $1 AND (user_id != 6 or user_id IS NULL)  [["department_id", 1]]