app/views/departments/employee_items.html.slim

          p.text-muted
            = @department.branch.company.name if @department.branch.company.present?
---
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        = form_tag(users_unassign_item_path, method: 'PUT', id: 'unassign-item')
          = select_tag 'item[status_item_id]',
                  options_for_select(StatusItem.all.map {|s| [s.name, s.id]}), {class: 'form-control'}
---
SELECT "items".* FROM "items" WHERE "items"."department_id" = $1 AND (user_id != 6 or user_id IS NULL)  [["department_id", 1]]
SELECT "status_items".* FROM "status_items"

        = form_tag(users_assign_item_path, method: 'PUT', id: 'assign-item')
          = select_tag 'item[status_item_id]',
                  options_for_select(StatusItem.all.map {|s| [s.name, s.id]}), {class: 'form-control'}
---
SELECT "status_items".* FROM "status_items"