app/views/departments/show.html.slim

            p.text-muted
              = @department.branch_name if @department.branch.present?
---
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

              .description-block
                h5.description-header = @department.items.count if @department.items.present?
---
SELECT "items".* FROM "items" WHERE "items"."department_id" = $1  [["department_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."department_id" = $1  [["department_id", 1]]

              .description-block
                h5.description-header = "$#{@department.items.sum(:price)}"
---
SELECT SUM("items"."price") FROM "items" WHERE "items"."department_id" = $1  [["department_id", 1]]

                          / td
                            - if user.items.count > 0
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = $1  [["user_id", 6]]