app/views/home/_list_items_reporter.html.slim

        td = item.try(:trailer).try(:sub_category).try(:name)
        td = item.status_item.name if item.status_item.present?
---
SELECT "status_items".* FROM "status_items" ORDER BY "status_items"."name" ASC