app/views/home/_list_items_reporter.html.slim

SELECT "branches".* FROM "branches" INNER JOIN "companies" ON "companies"."id" = "branches"."company_id" WHERE (companies.id = 1) ORDER BY companies.name ,branches.name, "branches"."name" ASC
SELECT "departments".* FROM "departments" WHERE "departments"."branch_id" = $1 ORDER BY "departments"."id" ASC  [["branch_id", 2]]
---

        /td = item.try(:user).try(:department).present? ? item.user.department.branch.name : ''