app/views/home/index.html.slim

                    .box-body style=('display: block;')
                      = f.collection_select :sub_category_category_id_in, policy_scope(Category).order(:name), :id, :name, {prompt: false},
                              {class: 'form-control select2', multiple: 'multiple', data: {placeholder: t('.category')}}
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1 ORDER BY name, "sub_categories"."id" ASC  [["category_id", 2]]