app/policies/application_policy.rb

  def general_policy(record = nil, query = nil, devise_controller = nil)
    if Rails.configuration.x.special_controllers.include? record.to_s.downcase
      record = record.to_s.singularize.capitalize
    else
      record = record.to_s.pluralize
    end
    if devise_controller
      devise_controller = devise_controller.to_s.pluralize
      permission = Permission.find_by_controller_and_action(devise_controller, query.to_s)
    else
      permission = Permission.find_by_controller_and_action(record, query.to_s)
    end

    user.role.permissions.include?(permission)
---
SELECT  "permissions".* FROM "permissions" WHERE "permissions"."controller" = $1 AND "permissions"."action" = $2 LIMIT $3  [["controller", "Branches"], ["action", "new"], ["LIMIT", 1]]
SELECT  1 AS one FROM "permissions" INNER JOIN "permission_roles" ON "permissions"."id" = "permission_roles"."permission_id" WHERE "permission_roles"."role_id" = $1 AND "permissions"."id" = $2 LIMIT $3  [["role_id", 4], ["id", 37], ["LIMIT", 1]]