app/policies/item_policy.rb

    def resolve
      if @user.god? or @user.admin?
        if @user.current_company.equal?(0)
          scope.all
        else
          ids = scope.joins(:company).where('companies.id = ?', @user.current_company).pluck(:id) +
              scope.joins(:direct_company)
                  .where('companies.id = ?', @user.current_company).pluck(:id)

          scope.where(id: ids)
        end
      elsif @user.admin_company?
        ids = scope.joins(:company).where('companies.user_id = ?', @user.id).pluck(:id) +
            scope.joins(:direct_company)
                .where('companies.user_id = ? and items.department_id is NULL', @user.id).pluck(:id)

        scope.where(id: ids)

      elsif @user.admin_branch?

        ids = scope.joins(:direct_branch).where('branches.manager_id = ? AND items.status_item_id = 2', @user.id).pluck(:id)

        status_id = StatusItem.where(key: %w(baja)).first
---
SELECT "items"."id" FROM "items" INNER JOIN "branches" ON "branches"."id" = "items"."branch_id" WHERE (branches.manager_id = 2 AND items.status_item_id = 2)
SELECT  "status_items".* FROM "status_items" WHERE "status_items"."key" = $1 ORDER BY "status_items"."id" ASC LIMIT $2  [["key", "baja"], ["LIMIT", 1]]