app/policies/user_policy.rb

SELECT "users"."id" FROM "users" INNER JOIN "departments" ON "departments"."id" = "users"."department_id" INNER JOIN "branches" ON "branches"."id" = "departments"."branch_id" WHERE "branches"."manager_id" = $1  [["manager_id", 2]]
SELECT "branches".* FROM "branches" WHERE "branches"."manager_id" = $1  [["manager_id", 2]]
SELECT "departments"."manager_id" FROM "departments" WHERE "departments"."branch_id" = $1  [["branch_id", 2]]
---
    def resolve
      scope.all.where.not(id: @user.id)
      if @user.god? or @user.admin?
        if @user.current_company.equal?(0)
          scope.all.order('users.employee_number asc')
        else
          ids = [@user.id]
          #Usuarios que son los directores de COMPAÑIA - company
          ids += scope.joins(:companies).where('companies.id = ?', @user.current_company).pluck(:user_id)
          #Usuarios que son Gerentes de SUCURSAL - BRANCH
          ids += scope.joins(companies: :branches).where('companies.id = ?', @user.current_company).pluck(:manager_id)
          #Usuarios que pertenecen a un DEPARTAMENTO - departament
          ids += scope.joins(companies: {branches: :departments}).where('companies.id = ?', @user.current_company).pluck('departments.manager_id')

          id_department = Company.joins(branches: :departments).where('companies.id = ?',@user.current_company).pluck('departments.id')

          ids.uniq!
          id_department.uniq!
          #scope.where(id: ids).order(:role_id)

           scope.where('users.id in (?) or department_id in (?) ',ids.compact,id_department.compact).order('users.employee_number asc')
        end
      elsif @user.admin_company?
        ids = [@user.id]
        @user.companies.each {|c| ids += c.branches.pluck(:manager_id) }
        @user.companies.each {|c| c.branches.each {|b| ids += b.departments.pluck(:manager_id)} }
        ids += scope.joins(:company).where(companies: { user_id: @user.id }).pluck(:id)

        ids.uniq!
        scope.where(id: ids).order('users.employee_number asc')
      elsif @user.admin_branch?
        ids = [@user.id]
        @user.branches.each {|b| ids += b.departments.pluck(:manager_id)}