app/views/trailers/index.html.slim

            .dataTables_info
              = pluralize(@trailers.count, 'trailer', 'trailers')
          .col-sm-7
            .dataTables_paginate.paging_simple_numbers
---
SELECT COUNT(*) FROM "trailers"