app/views/companies/_form.html.slim

      .col-sm-10
        = f.collection_select(:user_id, User.all, :id, :full_name,
                {prompt: t('helpers.select.prompt')}, {class: 'form-control'})
  .box-footer
---
SELECT "users".* FROM "users"