app/views/companies/show.json.jbuilder

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "branches".* FROM "branches" WHERE "branches"."company_id" = $1 ORDER BY branches.name  [["company_id", 1]]
---
json.boss "#{admin.try(:first_name)} #{admin.try(:last_name)}"
json.manager @company.user.nil? ? "" :"#{@company.user.first_name} #{@company.user.last_name}"
json.branches @company.branches.order('branches.name').each do |branch|