app/helpers/application_helper.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def selected_company
    if current_user.current_company.nil?
      'SIN EMPRESA'
    elsif current_user.current_company.equal?(0)
      'TODAS LAS EMPRESAS'
    else
      @current_company = Company.find(current_user.current_company)

SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = $1  [["user_id", 4]]
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def search_company_user user
    if user.try(:companies).present?
      Company.where(user_id: user.id).first.try(:name)