app/views/roles/role_permissions.html.slim

                              .checkbox.icheck
                                = check_box_tag "permissions_ids[#{permission.id}]", permission.id,
                                  @role.permissions.include?(permission), class: 'icheck-me', data: {skin: 'square', color: 'blue'}
                              .permissions-description
---
SELECT  1 AS one FROM "permissions" INNER JOIN "permission_roles" ON "permissions"."id" = "permission_roles"."permission_id" WHERE "permission_roles"."role_id" = $1 AND "permissions"."id" = $2 LIMIT $3  [["role_id", 6], ["id", 39], ["LIMIT", 1]]