app/views/items/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

                              <h3 class="timeline-header"><strong><%=t(".audit.create")  %> <%= t(".audit.by") %>  <%= "#{User.find(audit.user_id).try(:employee_number)} - #{User.find(audit.user_id).try(:full_name)}"  if audit.user_id.present? %> </strong></h3>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

                          <h3 class="timeline-header"><strong><%=t(".audit.create")  %> <%= t(".audit.by") %>  <%= "#{User.find(audit.user_id).try(:employee_number)} - #{User.find(audit.user_id).try(:full_name)}"  if audit.user_id.present? %> </strong></h3>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                            <strong>
                              <%=t(".audit.#{audit.action}")  %> <%= t(".audit.by") %>  <%= "#{User.find(audit.user_id).try(:employee_number)} - #{User.find(audit.user_id).try(:full_name)}"  if audit.user_id.present? %>

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                                  <% when "department_id"  %>
                                    <%= " #{t('.audit.from')} " %> <strong><%= audit.audited_changes[key][0].nil? ? "#{t('.audit.nil')}" : Department.find_by(id: audit.audited_changes[key][0].to_s).try('name') %></strong>

SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                                <% when "sub_category_id"  %>
                                    <%= " #{t('.audit.from')} " %> <strong><%= audit.audited_changes[key][0].nil? ? "#{t('.audit.nil')}" : SubCategory.find_by(id: audit.audited_changes[key][0].to_s).try('name') %></strong>

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "status_items".* FROM "status_items" WHERE "status_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "status_items".* FROM "status_items" WHERE "status_items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                                  <% when "status_item_id"  %>
                                    <%= " #{t('.audit.from')} " %> <strong><%= audit.audited_changes[key][0].nil? ? "#{t('.audit.nil')}" : StatusItem.find_by(id: audit.audited_changes[key][0].to_s).try('name') %></strong>
                                    <%= " #{t('.audit.to')} " %> <strong><%= audit.audited_changes[key][1].nil? ? "#{t('.audit.nil')}" : StatusItem.find_by(id: audit.audited_changes[key][1].to_s).try('name') %></strong>