app/controllers/application_controller.rb

  def user_employee_nomber
    @user = User.where(employee_number: params["employee_nomber"]).first
---
SELECT  "users".* FROM "users" WHERE "users"."employee_number" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["employee_number", 1234], ["LIMIT", 1]]

  def check_user_company

    unless current_user.nil?
      unless current_user.current_company.nil?

        @current_company = Company.find(current_user.current_company) unless current_user.current_company.eql?(0)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]