app/controllers/branches_controller.rb

SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_branch
    @branch = Branch.find(params[:id])