app/controllers/companies_controller.rb

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "user_id" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["user_id", 1], ["updated_at", "2020-09-09 16:39:14.881848"], ["id", 1]]