app/controllers/departments_controller.rb

  def update


    new_params = department_params
    # new_params[:last_code] = sprintf('%04d', department_params[:sequence])

    respond_to do |format|
      if @department.update(new_params)
---
UPDATE "departments" SET "name" = $1, "last_code" = $2, "updated_at" = $3 WHERE "departments"."id" = $4  [["name", "Cuauhtemoc"], ["last_code", "0001"], ["updated_at", "2020-09-10 05:22:32.187018"], ["id", 1]]

  def destroy
    respond_to do |format|
      if @department.destroy
---
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 2]]

  def employee_items
    @employee = User.find(params[:employee_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def get_departments_by_branch
    @department = Department.find_by(branch_id: params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."branch_id" = $1 LIMIT $2  [["branch_id", 0], ["LIMIT", 1]]