app/controllers/home_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT "branches".* FROM "branches" INNER JOIN "companies" ON "companies"."id" = "branches"."company_id" WHERE (companies.id = 1) ORDER BY companies.name ,branches.name, "branches"."name" ASC
SELECT COUNT(*) FROM "branches" INNER JOIN "companies" ON "companies"."id" = "branches"."company_id" WHERE (companies.id = 1)
SELECT "departments".* FROM "departments" WHERE "departments"."branch_id" = $1 ORDER BY "departments"."id" ASC  [["branch_id", 2]]
SELECT COUNT(*) FROM "departments" INNER JOIN "branches" ON "branches"."id" = "departments"."branch_id" INNER JOIN "companies" ON "companies"."id" = "branches"."company_id" WHERE (companies.id = 1)
SELECT "brands".* FROM "brands" ORDER BY "brands"."name" ASC
SELECT "categories".* FROM "categories" INNER JOIN "companies" ON "companies"."id" = "categories"."company_id" INNER JOIN "branches" ON "branches"."company_id" = "companies"."id" WHERE (branches.manager_id = 2 ) ORDER BY categories.name, "categories"."name" ASC
---


    if  params[:column].eql? "Responsable"
      @items = @search_items.result.eager_load(:user).order('users.last_name asc').paginate(page: params[:page], per_page: 20) #if @search_items.sorts.empty?
    elsif params[:column].eql? "branch"
      @items = @search_items.result.eager_load(user: [:branch, {departments: :branch}]).order('branches.name asc, branches_departments.name asc').paginate(page: params[:page], per_page: 20)
    elsif params[:column].eql? "department"
      @items = @search_items.result.eager_load(user: [:department, :departments ]).order("departments.name #{sort_direction}, departments_users #{sort_direction}").paginate(page: params[:page], per_page: 20)
    elsif params[:column].eql? "brand"
      @items = @search_items.result.eager_load(:brand).order("brands.name #{sort_direction}").paginate(page: params[:page], per_page: 20)
    elsif params[:column].eql?("category")
      @items = @search_items.result.eager_load(:category).order("categories.name #{sort_direction}").paginate(page: params[:page], per_page: 20)