app/controllers/items_controller.rb

SELECT  "status_items".* FROM "status_items" WHERE "status_items"."key" = $1 ORDER BY "status_items"."id" ASC LIMIT $2  [["key", "baja"], ["LIMIT", 1]]
---
  def show
    @status_item_vendidos = StatusItem.where(key: ['vendido', 'pendiente_factura', 'vendido_credito'])

SELECT "branches".* FROM "branches"
---
  def new
    @item = Item.new
    @users = Company.where(id: current_user.current_company)
    @branches = Branch.all #current_user.current_company.eql?(0) ? policy_scope(Branch).order(:name) : policy_scope(Branch).where(company_id: @current_company.try(:id)).order(:name)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

        Item.fcm_push_notification('REMOLQUE VENDIDO', @item.try(:user).try(:full_name), User.first.try(:token))

        Department.find(@item.department_id).update(last_code: @item.code) if @item.department_id