app/controllers/items_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def new
    unless current_user.try(:current_company).eql?(0) or current_user.try(:current_company).eql?(nil)
      @item = Item.new
      @users =  Company.where(id: current_user.current_company)
      @branches = current_user.current_company.eql?(0) ? policy_scope(Branch).order(:name) : policy_scope(Branch).where(company_id: @current_company.try(:id)).order(:name)
      @categories = Category.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    if current_user.current_company.eql? 0
      @users =  Company.all
    else
      @users =  Company.where(id: current_user.current_company)
    end
    @branches = current_user.current_company.eql?(0) ? policy_scope(Branch).order(:name) : policy_scope(Branch).where(company_id: @current_company.try(:id)).order(:name)
    @categories = Category.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("name", "description", "model", "serial_number", "purchased_date", "price", "sub_category_id", "department_id", "status_item_id", "created_at", "updated_at", "code", "maintenance_done", "branch_id", "category_id", "remission", "accessory") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "departments" SET "last_code" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["last_code", "nuevoarticulofolio"], ["updated_at", "2020-08-31 16:36:12.258430"], ["id", 1]]
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create

    @users =  Company.where(id: current_user.current_company)


    @branches = current_user.current_company.eql?(0) ? policy_scope(Branch).order(:name) : policy_scope(Branch).where(company_id: @current_company.try(:id)).order(:name);

    new_params = item_params
    if item_params[:user_id].eql?('')
      new_params[:user_id] = params[:boss_id]
    end


    @item = Item.new(new_params)

    respond_to do |format|
      if @item.save

        unless @item.department_id
          code = Branch.find(@item.branch_id).try(:code)
          last_code_c = Branch.find(@item.branch_id).last_code + 1
          Branch.find(@item.branch_id).update(last_code: last_code_c) unless @item.department_id
          Branch.where(code: code).update_all last_code: last_code_c  unless @item.department_id
        end

        Department.find(@item.department_id).update(last_code: @item.code) if @item.department_id

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = $1, "price" = $2, "category_id" = $3, "status_item_id" = $4 WHERE "items"."id" = $5  [["updated_at", "2020-09-10 03:44:38.104973"], ["price", "0.0"], ["category_id", 2], ["status_item_id", 2], ["id", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "departments" SET "last_code" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["last_code", "195301"], ["updated_at", "2020-09-10 03:44:38.175221"], ["id", 1]]
---
  def update
    if current_user.current_company.eql? 0
      @users =  Company.all
    else
      @users =  Company.where(id: current_user.current_company)
    end

    @branches = current_user.current_company.eql?(0) ? policy_scope(Branch).order(:name) : policy_scope(Branch).where(company_id: @current_company.try(:id)).order(:name);

    new_params = item_params

    if item_params[:user_id].eql?('')

      if params[:boss_id].eql?("null")
        @role_admin = Role.where(key: "admin").last.id
        @boss = User.where(role_id: @role_admin).first
        new_params[:user_id] = @boss.id
      else
        new_params[:user_id] = params[:boss_id]
      end

    end

    respond_to do |format|
      if @item.update(new_params)

        Department.find(@item.department_id).update(last_code: @item.code) if @item.department_id