app/controllers/roles_controller.rb

  def index
    @search_roles = Role.ransack(params[:q])
    @roles = @search_roles.result.paginate(page: params[:page], per_page: 20)
---
SELECT  "roles".* FROM "roles" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "roles"

  def update
    respond_to do |format|
      if @role.update(update_role_params)
---
UPDATE "roles" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "roles"."id" = $4  [["name", "Vendedor"], ["description", "Vendedores de remolques del sistema."], ["updated_at", "2020-09-09 22:50:18.287821"], ["id", 6]]

  def role_permissions
    add_breadcrumb t('breadcrumbs.roles'), :roles_path
    @role = Role.find(params[:role_id])
    @permissions = Permission.order('controller').where.not(controller: ['WorkArticles']).group_by { |t| t.controller }
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."controller" != $1 ORDER BY controller  [["controller", "WorkArticles"]]