app/controllers/sub_categories_controller.rb

SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1 LIMIT $2  [["category_id", 1], ["LIMIT", 1]]
---
    def set_sub_category
      @sub_category = SubCategory.find(params[:id])