app/controllers/trailers_controller.rb

  def create
    @trailer = Trailer.new(trailer_params)

    respond_to do |format|
      if @trailer.save
---
INSERT INTO "trailers" ("name", "model", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Remolque Ligero"], ["model", "3BZBP0714LC010760"], ["created_at", "2020-09-09 07:52:25.405254"], ["updated_at", "2020-09-09 07:52:25.405254"]]

    def set_trailer
      @trailer = Trailer.find(params[:id])
---
SELECT  "trailers".* FROM "trailers" WHERE "trailers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]