app/models/department.rb

  belongs_to :manager, class_name: 'User', foreign_key: 'manager_id'

  has_many :items
  has_many :employees,
           -> { where(role_id: Role.where(key: %w(empleado empleado_sin_acceso)).pluck(:id)) },
           class_name: 'User',
           foreign_key: 'department_id'
---
SELECT "roles"."id" FROM "roles" WHERE "roles"."key" IN ($1, $2)  [["key", "empleado"], ["key", "empleado_sin_acceso"]]