app/models/user.rb

  def unassigned_items
    self.department.items.where('user_id != ? or user_id IS NULL', self.id)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]