app/controllers/users/registrations_controller.rb

  def show
    add_breadcrumb @user.full_name, :user_path
    @role_admin = Role.find_by_key("admin").id
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id

    if @user.role_id.eql? @role_accessless
      #@user_department = Department.where(id:@user.department_id)
      #@user_branch = Branch.where(id: @user_department.try(:first).try(:branch_id))
      #@boss = @user_department.manager
      #@boss = User.find(@user.id).try(:department).try(:manager).try(:full_name).try(:upcase)
      #@search_items_user = Item.where(department_id: @user_department.try(:first).try(:id)).ransack(params[:q])
      #@boss_items = @search_items_user.result
      #@items = @employee.items
      #@boss_items = @user.unassigned_items

      @search_items_user = @user.unassigned_items.ransack(params[:q])
      @user_branch = @user.department.branch
      @boss_items = @search_items_user.result.paginate(page: params[:page], per_page: 20)

    elsif @user.admin_department?
      @user_department = Department.where(manager_id:@user.id)
      @user_branch = Branch.where(id: @user_department.try(:first).try(:branch_id))
      @boss = @user_department.try(:first).try(:branch).try(:user)
      @search_items_user = Item.where(department_id: @user_department.try(:first).try(:id)).ransack(params[:q])
      @boss_items = @search_items_user.result.where.not(id: @user.items.pluck(:id)).paginate(page: params[:page], per_page: 20)
      #@boss_items = @search_items_user.result.paginate(page: params[:page], per_page: 20)
    elsif @user.admin_branch?
      @user_branch = Branch.where(manager_id:@user.id)
      @boss = @user_branch.try(:first).try(:company).try(:user)
      @search_items_user = Item.where(branch_id:  @user_branch.pluck(:id)).ransack(params[:q])
      @boss_items = @search_items_user.result.where.not(id: @user.items.pluck(:id)).paginate(page: params[:page], per_page: 20)
---
SELECT "roles"."id" FROM "roles" WHERE "roles"."key" IN ($1, $2)  [["key", "empleado"], ["key", "empleado_sin_acceso"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."key" = $1 LIMIT $2  [["key", "admin"], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 4], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = $1  [["user_id", 7]]
SELECT  "branches".* FROM "branches" WHERE "branches"."manager_id" = $1 ORDER BY "branches"."id" ASC LIMIT $2  [["manager_id", 4], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."manager_id" = $1 ORDER BY "departments"."id" ASC LIMIT $2  [["manager_id", 7], ["LIMIT", 1]]
SELECT  "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."department_id" = $1 AND (user_id != 7 or user_id IS NULL) LIMIT $2 OFFSET $3  [["department_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67, $68, $69, $70, $71, $72, $73, $74, $75, $76, $77, $78, $79, $80, $81, $82, $83, $84, $85, $86, $87, $88, $89, $90, $91, $92, $93, $94, $95, $96, $97, $98, $99, $100, $101, $102)
SELECT "branches"."id" FROM "branches" WHERE "branches"."manager_id" = $1  [["manager_id", 4]]
SELECT "items"."id" FROM "items" WHERE "items"."user_id" = $1  [["user_id", 7]]
SELECT "items"."id" FROM "items" WHERE "items"."user_id" = $1  [["user_id", 4]]

      @boss = User.find_by_role_id(id).try(:full_name).try(:upcase)
      #@boss = User.where(role_id: @role_admin)
      @search_items_user = Item.joins(:branch).where('branches.company_id = ?', @user.current_company).ransack(params[:q])
      @user_branch = Company.find(@user.current_company).try(:branches)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new_user
    add_breadcrumb t('helpers.new'), :new_user_path
    @user = User.new(department_id: params[:department_id])
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id
---
SELECT  "roles".* FROM "roles" WHERE "roles"."key" = $1 LIMIT $2  [["key", "empleado_sin_acceso"], ["LIMIT", 1]]

  def new_employee_department
    #add_breadcrumb proc { I18n.t('breadcrumbs.departments') }, :new_employee_department_path
    #add_breadcrumb t('helpers.new'), :new_employee_department_path
    @user = User.new(department_id: params[:department_id])
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id
    @roles = Role.where(key: %w(empleado_sin_acceso))
    @boss_name = Department.find(params[:department_id])

    if @boss_name.manager.present?
---
SELECT  "roles".* FROM "roles" WHERE "roles"."key" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["key", "empleado_sin_acceso"], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."key" = $1 LIMIT $2  [["key", "empleado_sin_acceso"], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 ORDER BY "departments"."updated_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit_user
    add_breadcrumb t('helpers.edit'), :edit_user_path
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id
    @manegment = Hash.new()

    if @user.role_id.eql? @role_accessless
      @user_department = Department.where(id:@user.department_id).order(:updated_at).last
      @user_branch = nil
      @user_company = nil
    else
      @user_department = Department.where(manager_id:@user.id).order(:updated_at).last
      @user_branch = Branch.where(manager_id:@user.id).order(:updated_at).last
      @user_company = Company.where(user_id:@user.id).order(:updated_at).last
---
SELECT  "roles".* FROM "roles" WHERE "roles"."key" = $1 LIMIT $2  [["key", "empleado_sin_acceso"], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 ORDER BY "departments"."updated_at" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."manager_id" = $1 ORDER BY "departments"."updated_at" DESC LIMIT $2  [["manager_id", 7], ["LIMIT", 1]]
SELECT  "branches".* FROM "branches" WHERE "branches"."manager_id" = $1 ORDER BY "branches"."updated_at" DESC LIMIT $2  [["manager_id", 7], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1 ORDER BY "companies"."updated_at" DESC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]

  def create_user


    @user = User.new(sign_up_params)

    respond_to do |format|
      if @user.save


        key_user = Role.find(@user.role_id).key

        case key_user
        when 'admin_empresa'
          Company.find(params[:user]['current_company']).update(user_id: @user.id) unless params[:user]['current_company'].eql? ''
        when 'admin_sucursal'
          Branch.find(params[:user]['branch']).update(manager_id: @user.id) unless params[:user]['branch'].eql? ''
        when 'admin_departamento'
          Department.find(params[:user]['department']).update(manager_id: @user.id) unless params[:user]['department'].eql? ''
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role_id", "first_name", "last_name", "maiden_name", "department_id", "employee_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update_user
    # prev_unconfirmed_email = @user.unconfirmed_email if @user.respond_to?(:unconfirmed_email)
    #
    # if @user.update(account_update_params)
    #   if is_flashing_format?
    #     flash_key = update_needs_confirmation?(resource, prev_unconfirmed_email) ? :update_needs_confirmation : :updated
    #     set_flash_message :notice, flash_key
    #   end
    #   set_flash_message :notice, :updated
    #   flash.now[:notice] = t('notifications_masc.success.resource.destroyed',
    #                          resource: t('users.registrations.new_user.resource'))
    #   redirect_to user_registrations_path
    # else
    #   render 'edit_user'
    # end
    #
    params[:user].delete(:password)
    params[:user].delete(:password_confirmation)

    respond_to do |format|
      if @user.update(sign_up_params)

        key_user = Role.find(@user.role_id).key
        case key_user
        when 'admin_empresa'
          Company.find(@user.current_company).update(user_id: @user.id) unless @user.current_company.eql? nil
        when 'admin_sucursal'
          Branch.find(params[:user]['branch']).update(manager_id: @user.id) unless params[:user]['branch'].eql? ''
        when 'admin_departamento'
          Department.find(params[:user]['department']).update(manager_id: @user.id) unless params[:user]['department'].eql? ''
---
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 6], ["updated_at", "2020-09-09 21:58:27.060400"], ["id", 7]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]