app/controllers/users/registrations_controller.rb

  def show
    add_breadcrumb @user.full_name, :user_path
    @role_admin = Role.find_by_key("admin").id
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id



    if @user.role_id.eql? @role_accessless
      #@user_department = Department.where(id:@user.department_id)
      #@user_branch = Branch.where(id: @user_department.try(:first).try(:branch_id))
      #@boss = @user_department.manager
      #@boss = User.find(@user.id).try(:department).try(:manager).try(:full_name).try(:upcase)
      #@search_items_user = Item.where(department_id: @user_department.try(:first).try(:id)).ransack(params[:q])
      #@boss_items = @search_items_user.result
      #@items = @employee.items
      #@boss_items = @user.unassigned_items

      @search_items_user = @user.unassigned_items.ransack(params[:q])
      @user_branch = @user.department.branch
      @boss_items = @search_items_user.result.paginate(page: params[:page], per_page: 20)

    elsif @user.admin_branch?
      @user_branch = Branch.where(manager_id: @user.id)
      @boss = @user_branch.try(:first).try(:company).try(:user)
      @search_items_user = Item.where(branch_id: @user_branch.pluck(:id)).ransack(params[:q])
      @boss_items = @search_items_user.result.where.not(id: @user.items.pluck(:id)).paginate(page: params[:page], per_page: 20)
      #@boss_items = @search_items_user.result.paginate(page: params[:page], per_page: 20)
    elsif @user.admin? or @user.god?
      @search_items_user = Item.ransack(params[:q])
      @boss_items = @search_items_user.result.paginate(page: params[:page], per_page: 20)
---
SELECT  "items".* FROM "items" WHERE "items"."branch_id" = $1 AND 1=1 LIMIT $2 OFFSET $3  [["branch_id", 2], ["LIMIT", 20], ["OFFSET", 0]]

  def new_employee_department
    #add_breadcrumb proc { I18n.t('breadcrumbs.departments') }, :new_employee_department_path
    #add_breadcrumb t('helpers.new'), :new_employee_department_path
    @user = User.new(department_id: params[:department_id])
    @role_accessless = Role.find_by_key("empleado_sin_acceso").id
    @roles = Role.where(key: %w(empleado_sin_acceso))
    @boss_name = Department.find(params[:department_id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]