app/views/users/registrations/_form.html.slim

        select.form-control ng-change="set_branches(company.id)" name='user[current_company]' ng-model="company" ng-options=("company as company.name for company in companies track by company.id")
          option value=""  Seleccione una Compañia...
        / = f.collection_select(:company, @companies, :id, :name,
                {prompt: t('helpers.select.prompt')}, {selected: @companies.first, class: 'form-control', "ng-model" => "company", "ng-change" => "set_branches(company)"})
    .row.form-group ng-show="company!=''"
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = $1 ORDER BY "companies"."updated_at" DESC LIMIT $2  [["user_id", 7], ["LIMIT", 1]]