app/views/users/registrations/show.html.slim

SELECT "departments".* FROM "departments" WHERE "departments"."branch_id" = $1  [["branch_id", 2]]
---
                  - if @user.admin_branch? or @user.admin_company?
                    - branch.departments.each do |department|

SELECT "items"."id" FROM "items" WHERE "items"."user_id" = $1  [["user_id", 4]]
---
        = form_tag(users_unassign_item_path, method: 'PUT', id: 'unassign-item')
          = select_tag 'item[status_item_id]',
                  options_for_select(policy_scope(StatusItem).all.map {|s| [s.name, s.id]}), {class: 'form-control'}